recode_region <- function(data) {
  df <- data
  df$russian[df$su =="Алтайский край, Бийский район"] <-"Алтайский край"
  df$russian[df$su =="Алтайский край, Бийский район "] <-"Алтайский край"
  df$russian[df$su =="Алтайский край, Курьинский район"] <-"Алтайский край"
  df$russian[df$su =="Алтайский край, Курьинский район "] <-"Алтайский край"
  df$russian[df$su =="Амурская область, Тамбовский район"] <-"Амурская область"
  df$russian[df$su =="Амурская область, Тамбовский район "] <-"Амурская область"
  df$russian[df$su =="Батайск: Ростовская область"] <-"Ростовская область"
  df$russian[df$su =="Бийск и Бийский р-н: Алтайский край"] <-"Алтайский край"
  df$russian[df$su =="Владивосток: Приморский край"] <-"Приморский край"
  df$russian[df$su =="Волгоградская обл. Руднянский район"] <-"Волгоградская область"
  df$russian[df$su =="Волгоградская обл. Руднянский район "] <-"Волгоградская область"
  df$russian[df$su =="Волосовский р-н: Ленинградская область"] <-"Ленинградская область"
  df$russian[df$su =="Вольск и Вольский р-н: Саратовская область"] <-"Саратовская область"
  df$russian[df$su =="г. Москва"] <-"г.Москва"
  df$russian[df$su =="г. Санкт-Петербург"] <-"г.Санкт-Петербург"
  df$russian[df$su =="г.Владивосток"] <-"Приморский край"
  df$russian[df$su =="г.Владивосток "] <-"Приморский край"
  df$russian[df$su =="г.Казань"] <-"Республика Татарстан"
  df$russian[df$su =="г.Казань "] <-"Республика Татарстан"
  df$russian[df$su =="г.Краснодар"] <-"Краснодарский край"
  df$russian[df$su =="г.Краснодар "] <-"Краснодарский край"
  df$russian[df$su =="г.Красноярск"] <-"Красноярский край"
  df$russian[df$su =="г.Красноярск "] <-"Красноярский край"
  df$russian[df$su =="г.Курган"] <-"Курганская область"
  df$russian[df$su =="г.Курган "] <-"Курганская область"
  df$russian[df$su =="г.Липецк"] <-"Липецкая область"
  df$russian[df$su =="г.Липецк "] <-"Липецкая область"
  df$russian[df$su =="г.Нижний Новгород"] <-"Нижегородская область"
  df$russian[df$su =="г.Нижний Новгород "] <-"Нижегородская область"
  df$russian[df$su =="г.Саратов"] <-"Саратовская область"
  df$russian[df$su =="г.Саратов "] <-"Саратовская область"
  df$russian[df$su =="г.Смоленск"] <-"Смоленская область"
  df$russian[df$su =="г.Томск"] <-"Томская область"
  df$russian[df$su =="г.Томск "] <-"Томская область"
  df$russian[df$su =="г.Тула"] <-"Тульская область"
  df$russian[df$su =="г.Челябинск"] <-"Челябинская область"
  df$russian[df$su =="г.Челябинск "] <-"Челябинская область"
  df$russian[df$su =="Георгиевск и Георгиевский р-н: Ставропольский край"] <-"Ставропольский край"
  df$russian[df$su =="Глазов и Глазовский р-н: Республика Удмуртия"] <-"Удмуртская Республика"
  df$russian[df$su =="до 2002г Ханты-Мансийский АО,Сургутский р-н; с 2003г Новосибирская область,Бердск и район"] <-"Ханты-Мансийский автономный округ-Югра"
  df$russian[df$su =="Залукокоаже и Залукокоажский р-н: Респ. Кабардино-Балкария"] <-"Кабардино-Балкарская Республика"
  df$russian[df$su =="Залукокоаже и Зольский р-н: Республика Кабардино-Балкария"] <-"Кабардино-Балкарская Республика"
  df$russian[df$su =="Земетчинский р-н: Пензенская область"] <-"Пензенская область"
  df$russian[df$su =="Кабардино-Балкарская Республика"] <-"Кабардино-Балкарская Республика"
  df$russian[df$su =="Кабардино-Балкарская Республика "] <-"Кабардино-Балкарская Республика"
  df$russian[df$su =="Казань: Республика Татарстан"] <-"Республика Татарстан"
  df$russian[df$su =="Калининская обл. Ржевский район"] <-"Калининградская область"
  df$russian[df$su =="Калужская обл. Куйбышевский район"] <-"Калужская область"
  df$russian[df$su =="Коми Республика, г.Сыктывкар"] <-"Республика Коми"
  df$russian[df$su =="Коми Республика, Усинский район"] <-"Республика Коми"
  df$russian[df$su =="Красноармейский р-н: Челябинская область"] <-"Челябинская область"
  df$russian[df$su =="Краснодар: Краснодарская область"] <-"Краснодарский край"
  df$russian[df$su =="Краснодар: Краснодарский край"] <-"Краснодарский край"
  df$russian[df$su =="Краснодарский край, Кущевский район"] <-"Краснодарский край"
  df$russian[df$su =="Краснодарский край, Кущевский район "] <-"Краснодарский край"
  df$russian[df$su =="Красноярск: Красноярский край"] <-"Красноярский край"
  df$russian[df$su =="Красноярский край, Назаровский район"] <-"Красноярский край"
  df$russian[df$su =="Красноярский край, Назаровский район "] <-"Красноярский край"
  df$russian[df$su =="Куйбышевский р-н, Калужская область"] <-"Калужская область"
  df$russian[df$su =="Куйбышевский р-н: Калужская область"] <-"Калужская область"
  df$russian[df$su =="Курган: Курганская область"] <-"Курганская область"
  df$russian[df$su =="Курьинский р-н: Алтайский край"] <-"Алтайский край"
  df$russian[df$su =="Кущевский р-н: Краснодарский край"] <-"Краснодарский край"
  df$russian[df$su =="Ленинградская обл., Волосовский район"] <-"Ленинградская область"
  df$russian[df$su =="Липецк: Липецкая область"] <-"Липецкая область"
  df$russian[df$su =="Миасский р-н: Челябинская область"] <-"Челябинская область"
  df$russian[df$su =="Москва"] <-"г.Москва"
  df$russian[df$su =="Московская область"] <-"Московская область"
  df$russian[df$su =="Назарово и Назаровский р-н: Красноярский край"] <-"Красноярский край"
  df$russian[df$su =="Нижний Новгород: Нижегородская область"] <-"Нижегородская область"
  df$russian[df$su =="Оренбургская обл., г.Орск"] <-"Оренбургская область"
  df$russian[df$su =="Оренбургская обл., г.Орск "] <-"Оренбургская область"
  df$russian[df$su =="Орск: Оренбургская область"] <-"Оренбургская область"
  df$russian[df$su =="Пензенская область, Земетчинский район"] <-"Пензенская область"
  df$russian[df$su =="Пензенская область, Земетчинский район "] <-"Пензенская область"
  df$russian[df$su =="Пермская обл., Соликамский район"] <-"Пермский край"
  df$russian[df$su =="Пермская обл., Соликамский район "] <-"Пермский край"
  df$russian[df$su =="Ржев и Ржевский р-н: Тверская область"] <-"Тверская область"
  df$russian[df$su =="Ростовская обл., г.Батайск"] <-"Ростовская область"
  df$russian[df$su =="Ростовская обл., г.Батайск "] <-"Ростовская область"
  df$russian[df$su =="Руднянский р-н: Волгоградская область"] <-"Волгоградская область"
  df$russian[df$su =="Рудянский р-н: Волгоградская область"] <-"Волгоградская область"
  df$russian[df$su =="Санкт Петербург"] <-"г.Санкт-Петербург"
  df$russian[df$su =="Саратов: Саратовская область"] <-"Саратовская область"
  df$russian[df$su =="Саратовская обл. Вольский район"] <-"Саратовская область"
  df$russian[df$su =="Саратовская обл. Вольский район "] <-"Саратовская область"
  df$russian[df$su =="Смоленск: Смоленская область"] <-"Смоленская область"
  df$russian[df$su =="Соликамск и Соликамский р-н: Пермская область"] <-"Пермский край"
  df$russian[df$su =="Соликамск и Соликамский р-н: Пермский край"] <-"Пермский край"
  df$russian[df$su =="Ставропольский край, Георгиевский район"] <-"Ставропольский край"
  df$russian[df$su =="Ставропольский край, Георгиевский район "] <-"Ставропольский край"
  df$russian[df$su =="Сыктывкар: Республика Коми"] <-"Республика Коми"
  df$russian[df$su =="Тамбовская обл., Уваровский район"] <-"Тамбовская область"
  df$russian[df$su =="Тамбовская обл., Уваровский район "] <-"Тамбовская область"
  df$russian[df$su =="Тамбовский р-н: Амурская область"] <-"Амурская область"
  df$russian[df$su =="Тверская обл. Ржевский район"] <-"Тверская область"
  df$russian[df$su =="Томск: Томская область"] <-"Томская область"
  df$russian[df$su =="Тула: Тульская область"] <-"Тульская область"
  df$russian[df$su =="Тюменская обл., Сургутский р-н: Ханты-Мансийский АО (1994-2002 гг)/ Бердск и район: Новосибирская обл. (2003-наст.вр.)"] <-"Тюменская область"
  df$russian[df$su =="Уварово и Уваровский р-н: Тамбовская область"] <-"Тамбовская область"
  df$russian[df$su =="Удмуртская Республика, Глазовский район"] <-"Удмуртская Республика"
  df$russian[df$su =="Удмуртская Республика, Глазовский район "] <-"Удмуртская Республика"
  df$russian[df$su =="Усинск и Усинский р-н: Республика Коми"] <-"Республика Коми"
  df$russian[df$su =="Ханты-Мансийский АО,Тюменская обл,Сургутский р-н(1994-2002 гг.)/Новосибирская область,Бердск и район(2003-наст.вр.)"] <-"Ханты-Мансийский автономный округ-Югра"
  df$russian[df$su =="Челябинск: Челябинская область"] <-"Челябинская область"
  df$russian[df$su =="Челябинская область"] <-"Челябинская область"
  df$russian[df$su =="Челябинская область "] <-"Челябинская область"
  df$russian[df$su =="Чувашская Республика, Шумерлинский район"] <-"Чувашская Республика"
  df$russian[df$su =="Чувашская Республика, Шумерлинский район "] <-"Чувашская Республика"
  df$russian[df$su =="Шумерля и Шумерлинский р-н: Республика Чувашия"] <-"Чувашская Республика"
  df  
}



recode_wave <- function(data,sample="all",level="household") {
  df <- data
  if (level =="individual" & sample == "rep") {
    df$year[df$wave =="r22i_os23"] <- 2013
    df$year[df$wave =="r21i_os23"] <- 2012
    df$year[df$wave =="r20i_os23"] <- 2011
    df$year[df$wave =="r19i_os23"] <- 2010
    df$year[df$wave =="r18i_os23"] <- 2009
    df$year[df$wave =="r17i_os23"] <- 2008
    df$year[df$wave =="r16i_os23"] <- 2007
    df$year[df$wave =="r15i_os23"] <- 2006
    df$year[df$wave =="r14i_os23"] <- 2005
    df$year[df$wave =="r13i_os23"] <- 2004
    df$year[df$wave =="r12i_os23"] <- 2003
    df$year[df$wave =="r11i_os23"] <- 2002
    df$year[df$wave =="r10i_os23"] <- 2001
    df$year[df$wave =="r09i_os23"] <- 2000
    df$year[df$wave =="r08i_os23"] <- 1999
    df$year[df$wave =="r07i_os23"] <- 1998
    df$year[df$wave =="r06i_os23"] <- 1997
    df$year[df$wave =="r05i_os23"] <- 1996
  }
  if (level =="individual" & sample == "all") {
    df$year[df$wave =="r22iall23"] <- 2013
    df$year[df$wave =="r21iall23"] <- 2012
    df$year[df$wave =="r20iall23"] <- 2011
    df$year[df$wave =="r19iall23"] <- 2010
    df$year[df$wave =="r18iall23"] <- 2009
    df$year[df$wave =="r17iall23"] <- 2008
    df$year[df$wave =="r16iall23"] <- 2007
    df$year[df$wave =="r15iall23"] <- 2006
    df$year[df$wave =="r14iall23"] <- 2005
    df$year[df$wave =="r13iall23"] <- 2004
    df$year[df$wave =="r12iall23"] <- 2003
    df$year[df$wave =="r11iall23"] <- 2002
    df$year[df$wave =="r10iall23"] <- 2001
    df$year[df$wave =="r09iall23"] <- 2000
    df$year[df$wave =="r08iall23"] <- 1999
    df$year[df$wave =="r07iall23"] <- 1998
    df$year[df$wave =="r06iall23"] <- 1997
    df$year[df$wave =="r05iall23"] <- 1996
  }
  if (level =="household"  & sample == "rep") {
    df$year[df$wave =="r22h_os23"] <- 2013
    df$year[df$wave =="r21h_os23"] <- 2012
    df$year[df$wave =="r20h_os23"] <- 2011
    df$year[df$wave =="r19h_os23"] <- 2010
    df$year[df$wave =="r18h_os23"] <- 2009
    df$year[df$wave =="r17h_os23"] <- 2008
    df$year[df$wave =="r16h_os23"] <- 2007
    df$year[df$wave =="r15h_os23"] <- 2006
    df$year[df$wave =="r14h_os23"] <- 2005
    df$year[df$wave =="r13h_os23"] <- 2004
    df$year[df$wave =="r12h_os23"] <- 2003
    df$year[df$wave =="r11h_os23"] <- 2002
    df$year[df$wave =="r10h_os23"] <- 2001
    df$year[df$wave =="r09h_os23"] <- 2000
    df$year[df$wave =="r08h_os23"] <- 1999
    df$year[df$wave =="r07h_os23"] <- 1998
    df$year[df$wave =="r06h_os23"] <- 1997
    df$year[df$wave =="r05h_os23"] <- 1996    
  }
  if (level =="household"  & sample == "all") {
    df$year[df$wave =="r22hall23"] <- 2013
    df$year[df$wave =="r21hall23"] <- 2012
    df$year[df$wave =="r20hall23"] <- 2011
    df$year[df$wave =="r19hall23"] <- 2010
    df$year[df$wave =="r18hall23"] <- 2009
    df$year[df$wave =="r17hall23"] <- 2008
    df$year[df$wave =="r16hall23"] <- 2007
    df$year[df$wave =="r15hall23"] <- 2006
    df$year[df$wave =="r14hall23"] <- 2005
    df$year[df$wave =="r13hall23"] <- 2004
    df$year[df$wave =="r12hall23"] <- 2003
    df$year[df$wave =="r11hall23"] <- 2002
    df$year[df$wave =="r10hall23"] <- 2001
    df$year[df$wave =="r09hall23"] <- 2000
    df$year[df$wave =="r08hall23"] <- 1999
    df$year[df$wave =="r07hall23"] <- 1998
    df$year[df$wave =="r06hall23"] <- 1997
    df$year[df$wave =="r05hall23"] <- 1996    
  }
  
  df
}


rec_yesno <- function(var) {
  var <- as.character(var)
  # da
  var[var == "да"] <- "yes"
  var[var == "‘Да’"] <- "yes"
  var[var == "‘да’"] <- "yes"
  var[var == "Да"] <- "yes"
  # njet
  var[var == "нет"] <- "no"
  var[var == "‘Нет’"] <- "no"
  var[var == "‘нет’"] <- "no"
  var[var == "Нет"] <- "no"
  # no opinion
  var[var == "ЗАТРУДНЯЮСЬ ОТВЕТИТЬ"] <- "no opinion"
  var[var == "‘ЗАТРУДНЯЮСЬ ОТВЕТИТЬ’"] <- "no opinion"
  var[var == "‘затрудняюсь ответить’"] <- "no opinion"
  # 
  var[var == "ОТКАЗ ОТ ОТВЕТА"] <- "missing"
  var[var == "НЕТ ОТВЕТА"] <- "missing"
  var[var == "‘ОТКАЗ ОТ ОТВЕТА’"] <- "missing"
  var[var == "‘НЕТ ОТВЕТА’"] <- "missing"
  var[var == "‘отказ’"] <- "missing"
  var[var == "‘ОТКАЗ’"] <- "missing"
  var[var == "‘НЕТ ОТВЕTА’"] <- "missing"
  var
}