
# removing regions not applicaple anymore
table(dfA$region)[10:20]
dfA <- dfA[dfA$region != "Агинский Бурятский авт.округ", ]
dfA <- dfA[dfA$region != "Агинский Бурятский автономный округ", ]
dfA <- dfA[dfA$region != "Алтайский край Бийская", ]
dfA <- dfA[dfA$region != "Алтайский край Барнаульская", ]
dfA <- dfA[dfA$region != "Алтайский край Рубцовская", ]
dfA <- dfA[dfA$region != "Более аграрные регионы ", ]
dfA <- dfA[dfA$region != "Волго-Вятский район", ]
dfA <- dfA[dfA$region != "Волгоградская область Волгоградская", ]
dfA <- dfA[dfA$region != "Волгоградская область Волжская", ]
dfA <- dfA[dfA$region != "Волгоградская область Михайловская", ]
dfA <- dfA[dfA$region != "Воронежская область Воронежская", ]
dfA <- dfA[dfA$region != "Воронежская область Павловская", ]
dfA <- dfA[dfA$region != "Восточно-Сибирский район", ]

dfA <- dfA[dfA$region != "Город Москва Восточная", ]
dfA <- dfA[dfA$region != "Город Москва Донская", ]
dfA <- dfA[dfA$region != "Город Москва Кунцевская", ]
dfA <- dfA[dfA$region != "Город Москва Люблинская", ]
dfA <- dfA[dfA$region != "Город Москва Медведковская", ]
dfA <- dfA[dfA$region != "Город Москва Тушинская", ]
dfA <- dfA[dfA$region != "Город Москва Царицынская", ]
dfA <- dfA[dfA$region != "Город Москва Центральная", ]
dfA <- dfA[dfA$region != "Город Москва Черемушкинская", ]
dfA <- dfA[dfA$region != "Город Москва Шереметьевская", ]

dfA <- dfA[dfA$region != "Город Санкт Петербург Восточная", ]
dfA <- dfA[dfA$region != "Город Санкт Петербург Западная", ]
dfA <- dfA[dfA$region != "Город Санкт Петербург Северная", ]
dfA <- dfA[dfA$region != "Город Санкт Петербург Центральная", ]
dfA <- dfA[dfA$region != "Город Санкт Петербург Южная", ]

dfA <- dfA[dfA$region != "Город Байконур Республика Казахстан", ]

dfA <- dfA[dfA$region != "Дальневосточный район", ]

dfA <- dfA[dfA$region != "Западно-Сибирский район", ]

dfA <- dfA[dfA$region != "Иркутская область Братская", ]
dfA <- dfA[dfA$region != "Иркутская область Иркутская", ]

dfA <- dfA[dfA$region != "Коми-Пермяцкий авт.округ", ]
dfA <- dfA[dfA$region != "Коми-Пермяцкий автономный округ", ]

dfA <- dfA[dfA$region != "Корякский автономный  округ", ]
dfA <- dfA[dfA$region != "Корякский автономный округ", ]

dfA <- dfA[dfA$region != "Краснодарский край Армавирская", ]
dfA <- dfA[dfA$region != "Краснодарский край Каневская", ]
dfA <- dfA[dfA$region != "Краснодарский край Краснодарская", ]
dfA <- dfA[dfA$region != "Краснодарский край Крымская", ]
dfA <- dfA[dfA$region != "Краснодарский край Сочинская", ]
dfA <- dfA[dfA$region != "Краснодарский край Лабинская", ]
dfA <- dfA[dfA$region != "Краснодарский край Усть Лабинская", ]

dfA <- dfA[dfA$region != "Красноярский край Ачинско Минусинская", ]
dfA <- dfA[dfA$region != "Красноярский край Красноярская", ]
dfA <- dfA[dfA$region != "Красноярский край Норильско Канская", ]

dfA <- dfA[dfA$region != "Московская область в старых границах", ]
dfA <- dfA[dfA$region != "Московская область Дмитровская", ]
dfA <- dfA[dfA$region != "Московская область Истринская", ]
dfA <- dfA[dfA$region != "Московская область Коломенская", ]
dfA <- dfA[dfA$region != "Московская область Люберецкая", ]
dfA <- dfA[dfA$region != "Московская область Ногинская", ]
dfA <- dfA[dfA$region != "Московская область Подольская", ]
dfA <- dfA[dfA$region != "Московская область Серпуховская", ]
dfA <- dfA[dfA$region != "Московская область Химкинская", ]

dfA <- dfA[dfA$region != "Нижегородская область Арзамасская", ]
dfA <- dfA[dfA$region != "Нижегородская область Кстовская ", ]
dfA <- dfA[dfA$region != "Нижегородская область Кстовская", ]
dfA <- dfA[dfA$region != "Нижегородская область Нижегородская", ]
dfA <- dfA[dfA$region != "Нижегородская область Семеновская", ]

dfA <- dfA[dfA$region != "Новосибирская область Заельцовская", ]
dfA <- dfA[dfA$region != "Новосибирская область Искитимская", ]
dfA <- dfA[dfA$region != "Новосибирская область Новосибирская", ]

dfA <- dfA[dfA$region != "Омская область Омская", ]
dfA <- dfA[dfA$region != "Омская область Центральная", ]

dfA <- dfA[dfA$region != "Оренбургская область Новотроицкая", ]
dfA <- dfA[dfA$region != "Оренбургская область Оренбургская", ]

dfA <- dfA[dfA$region != "Пермский край Северная", ]
dfA <- dfA[dfA$region != "Пермский край Центральная", ]
dfA <- dfA[dfA$region != "Пермский край Южная", ]

dfA <- dfA[dfA$region != "Поволжский район", ]

dfA <- dfA[dfA$region != "Приморский край Северная", ]
dfA <- dfA[dfA$region != "Приморский край Южная", ]

dfA <- dfA[dfA$region != "Республика Адыгея Адыгея", ]

dfA <- dfA[dfA$region != "Республика Башкортостан Бирская", ]
dfA <- dfA[dfA$region != "Республика Башкортостан Салаватская", ]
dfA <- dfA[dfA$region != "Республика Башкортостан Стерлитамакская", ]
dfA <- dfA[dfA$region != "Республика Башкортостан Уфимская", ]

dfA <- dfA[dfA$region != "Республика Дагестан Дербентская", ]
dfA <- dfA[dfA$region != "Республика Дагестан Махачкалинская", ]

dfA <- dfA[dfA$region != "Республика Татарстан Татарстан", ]
dfA <- dfA[dfA$region != "Республика Татарстан Татарстан Московская", ]
dfA <- dfA[dfA$region != "Республика Татарстан Татарстан Набережночелнинская", ]
dfA <- dfA[dfA$region != "Республика Татарстан Татарстан Нефтяная", ]
dfA <- dfA[dfA$region != "Республика Татарстан Татарстан Центральная", ]

dfA <- dfA[dfA$region != "Ростовская область Волгодонская", ]
dfA <- dfA[dfA$region != "Ростовская область Каменская", ]
dfA <- dfA[dfA$region != "Ростовская область Новочеркасская", ]
dfA <- dfA[dfA$region != "Ростовская область Ростовская", ]

dfA <- dfA[dfA$region != "Самарская область Волжская", ]
dfA <- dfA[dfA$region != "Самарская область Самарская", ]
dfA <- dfA[dfA$region != "Самарская область Тольяттинская", ]

dfA <- dfA[dfA$region != "Саратовская область Балаковская", ]
dfA <- dfA[dfA$region != "Саратовская область Балашовская", ]
dfA <- dfA[dfA$region != "Саратовская область Саратовская", ]

dfA <- dfA[dfA$region != "Свердловская область Нижнетагильская", ]
dfA <- dfA[dfA$region != "Свердловская область Каменск Уральская", ]
dfA <- dfA[dfA$region != "Свердловская область Первоуральская", ]
dfA <- dfA[dfA$region != "Свердловская область Серовская", ]
dfA <- dfA[dfA$region != "Свердловская область Центральная", ]

dfA <- dfA[dfA$region != "Северный район", ]
dfA <- dfA[dfA$region != "Северо-Западный район", ]
dfA <- dfA[dfA$region != "Северо-Кавказский район", ]

dfA <- dfA[dfA$region != "Ставропольский край Пятигорская", ]
dfA <- dfA[dfA$region != "Ставропольский край Ставропольская", ]

dfA <- dfA[dfA$region != "Сумма", ]

dfA <- dfA[dfA$region != "Таймырский (Долгано-Ненецкий) авт.округ", ]
dfA <- dfA[dfA$region != "Таймырский (Долгано-Ненецкий) автономный округ", ]

dfA <- dfA[dfA$region != "Территория за пределами РФ", ]

dfA <- dfA[dfA$region != "Тульская область Новомосковская", ]
dfA <- dfA[dfA$region != "Тульская область Тульская", ]

dfA <- dfA[dfA$region != "Уральский район", ]


dfA <- dfA[dfA$region != "Усть-Ордынский Бурятский авт.округ", ]
dfA <- dfA[dfA$region != "Усть Ордынский Бурятский автономный округ", ]
dfA <- dfA[dfA$region != "Усть-Ордынский Бурятский автономный округ", ]

dfA <- dfA[dfA$region != "Центрально-Черноземный район", ]
dfA <- dfA[dfA$region != "Центральный район", ]

dfA <- dfA[dfA$region != "Челябинская область Златоустовская", ]
dfA <- dfA[dfA$region != "Челябинская область Калининская", ]
dfA <- dfA[dfA$region != "Челябинская область Кыштымская", ]
dfA <- dfA[dfA$region != "Челябинская область Магнитогорская", ]

dfA <- dfA[dfA$region != "Чувашская Республика Чувашия", ]

dfA <- dfA[dfA$region != "Эвенкийский авт.окpуг", ]
dfA <- dfA[dfA$region != "Эвенкийский автономный окpуг", ]

dfA <- dfA[dfA$region != "Южный федеральный округ (по 2009 год)", ]
dfA <- dfA[dfA$region != "Южный федеральный  округ (с 2010 года)", ]

# rename
dfA$region[dfA$region == "Архангельская область (без АО)"] <- "Архангельская область"
dfA$region[dfA$region == "Архангельская область (частично)"] <- "Архангельская область"

dfA$region[dfA$region == "в том числе Ненецкий автономный округ"] <- "в том числе Ненецкий автономный округ"
dfA$region[dfA$region == "в том числе Ненецкий \r\nавтономный округ"] <- "в том числе Ненецкий автономный округ"
dfA$region[dfA$region == "в том числе Ненецкий\r\nавтономный округ"] <- "в том числе Ненецкий автономный округ"

dfA$region[dfA$region == "г. Москва"] <- "г.Москва"
dfA$region[dfA$region == "г.Москва"] <- "г.Москва"
dfA$region[dfA$region == "Город Москва"] <- "г.Москва"

dfA$region[dfA$region == "Город Санкт Петербург"] <- "г.Санкт-Петербург"
dfA$region[dfA$region == "г. Санкт-Петербург"] <- "г.Санкт-Петербург"

dfA$region[dfA$region == "Еврейская авт.область"] <- "Еврейская автономная область"
dfA$region[dfA$region == "Еврейская автономная\r\nобласть"] <- "Еврейская автономная область"

dfA$region[dfA$region == "Кабардино Балкарская Республика"] <- "Кабардино-Балкарская Республика"

dfA$region[dfA$region == "Камчатская область"] <- "Камчатский край"

dfA$region[dfA$region == "Карачаево Черкесская Республика"] <- "Карачаево-Черкесская Республика"

library(stringr)
dfA$region <- str_replace_all(dfA$region, "(Нижегородская область.)", "Нижегородская")
dfA$region[dfA$region == "Нижегородская"] <- "Нижегородская область"

dfA$region <- str_replace_all(dfA$region, "(Новосибирская область.)", "Новосибирская область")

dfA$region[dfA$region == "Пермская область"] <- "Пермский край"

dfA$region[dfA$region == "Республика\r\nБашкортостан"] <- "Республика Башкортостан"

dfA$region[dfA$region == "Республика Ингушетия (1990 г. - включая Чеченскую Республику)"] <- "Республика Ингушетия"
dfA$region[dfA$region == "Республика Ингушетия \r\n(1990 г. - включая Чеченскую Республику)"] <- "Республика Ингушетия"

dfA$region[dfA$region == "Республика Саха Якутия"] <- "Республика Саха (Якутия)"
dfA$region[dfA$region == "Республика Саха\r\n(Якутия)"] <- "Республика Саха (Якутия)"

dfA$region[dfA$region == "Республика Северная \r\nОсетия -Алания"] <- "Республика Северная Осетия - Алания"
dfA$region[dfA$region == "Республика Северная Осетия Алания"] <- "Республика Северная Осетия - Алания"

dfA$region[dfA$region == "Российская Федерация, из них:"] <- "Российская Федерация"

dfA$region[dfA$region == "Тюменская область (без АО)"] <- "Тюменская область"
dfA$region[dfA$region == "Тюменская область (частично)"] <- "Тюменская область"

dfA$region[dfA$region == "Ханты Мансийский автономный округ Югра"] <- "Ханты-Мансийский автономный округ-Югра"
dfA$region[dfA$region == "Ханты-Мансийский автономный округ - Югра"] <- "Ханты-Мансийский автономный округ-Югра"
dfA$region[dfA$region == "Ханты-Мансийский автономный округ-Югра"] <- "Ханты-Мансийский автономный округ-Югра"
dfA$region[dfA$region == "Ханты-Мансийский\r\nавтономный округ - Югра"] <- "Ханты-Мансийский автономный округ-Югра"
dfA$region[dfA$region == "Ханты-Мансийский АО"] <- "Ханты-Мансийский автономный округ-Югра"

dfA$region[dfA$region == "Чеченская респ."] <- "Чеченская Республика"
dfA$region[dfA$region == "Чеченская Республика (1990 г. - включая Республику Ингушетия)"] <- "Чеченская Республика"
dfA$region[dfA$region == "Чеченская Республика \r\n(1990 г. - включая Республику Ингушетия)"] <- "Чеченская Республика"

dfA$region[dfA$region == "Чукотский АО"] <- "Чукотский автономный округ"

dfA$region[dfA$region == "Ямало Ненецкий автономный округ"] <- "Ямало-Ненецкий автономный округ"
dfA$region[dfA$region == "Ямало-Ненецкий автономный округ"] <- "Ямало-Ненецкий автономный округ"
dfA$region[dfA$region == "Ямало-Ненецкий\r\nавтономный округ"] <- "Ямало-Ненецкий автономный округ"
dfA$region[dfA$region == "Ямало-Ненецкий АО"] <- "Ямало-Ненецкий автономный округ"

## See

#head(dfA[dfA$region == "Чувашская Республика Чувашия", ])
